<?php
    // Отримати залишок від ділення 7 на 3
    $x = 7;
    $y = 3;

    $result = $x % $y;
    echo $result;

    // Отримати цілу частину ділення 7 и 7,15

    $x = 7;
    $y = 7.15;

    $result = intdiv($x, $y);
    echo $result;

    // Отримати корінь из 25

    $x = 25;
    $y = 1/2;

    $result = $x ** $y;
    echo $result;

    // Отримати 4-е слово з фрази - Десять человек пошли купаться в море

    $x = 'Десять человек пошли купаться в море';
    $y = explode(" ", $x);
    $forthWord = $y[3];
    print_r($forthWord);

    // Отримати 17-й символ із фрази - Десять человек пошли купаться в море

    $x = 'Десять человек пошли купаться в море';
    $y = mb_substr($x, 16, 1);
    print($y);

    // Зробити великою кожну першу букву слів фрази - Десять человек пошли купаться в море

    $x = 'Десять человек пошли купаться в море';
    $y = mb_convert_case($x, MB_CASE_TITLE);
    print($y);

    // Порахувати длину строки - Десять человек пошли купаться в море

    $x = 'Десять человек пошли купаться в море';
    $y = iconv_strlen($x);
    print($y);

    // Чи вірно твердження true дорівнює 1

    $x = true;
    $y = 1;
    $z = $x == $y;
    var_dump($z); // так, вірно
    
    // Чи вірно твердження false тождественно 0

    $x = false;
    $y = 0;
    $z = $x === $y;
    var_dump($z); // ні, не вірно

    // Яка строка більше three - три

    $x = "three";
    $y = "три";
    $z = strcmp($x, $y);
    print($z); // строка "три" лексикографічно більше

    // Яке число більше 125 умножить на 13 плюс 7 или 223 плюс 28 умножить 2

    $x = 125 * 13 + 7;
    $y = 223 + 28 * 2;
    $z = $x > $y;
    var_dump($z); // true, перше число більше

?>